### LSE Data Analytics Online Career Accelerator

# DA201: Data Analytics using Python

## Practical activity: Pandas DataFrame

**This is the solution to the activity.**

You will create the DataFrame(s) that will capture all the Human Resources (HR) information. The following raw data was provided by HR:

`RAW DATA`
- Staff members and employment units (in brackets): Shen Lee (1), Leon Buhle (0.5), Tracy Adams (0.8), Lebo Sinuka (1.5), Lauren Pierce (1.2), Monika Bond (2), Natahs Allsopp (0.3), Nicholas Winter (1.1), Christopher Eckson (2.2), and Siobhan O’Malley (1.5).
- Personnel numbers: Shen Lee (215), Leon Buhle (216), Tracy Adams (217), Lebo Sinuka (218), Lauren Pierce (219), Monika Bond (220), Natahs Allsopp (221), Nicholas Winter (222), Christopher Eckson (223), and Siobhan O’Malley (224).
- Leave per cycle: 10 days sick leave, 20 days annual leave, 5 days personal leave, and 3 days added for one full unit of employment as a bonus.
- Leave taken in the current cycle (days):
  - Shen Lee: 0 days
  - Leon Buhle: 2 sick, 0 annual leave, 1 personal
  - Tracy Adams: 0 sick, 5 annual leave, 0 personal
  - Lebo Sinuka: 1 sick, 4 annual leave, 5 personal
  - Lauren Pierce: 3 sick, 2 annual leave, 0 personal
  - Monika Bond: 0 sick, 5 annual leave, 3 personal
  - Natahs Allsopp: 1 sick, 10 annual leave, 0 personal
  - Nicholas Winter: 0 sick, 8 annual leave, 1 personal
  - Christopher Eckson: 2 sick, 10 annual leave, 3 personal
  - Siobhan O’Malley: 5 sick, 0 annual leave, 0 personal.

### Leave configuration

In [2]:
# Leave configuration
# Import Pandas library
import pandas as pd

# Create a DataFrame from a dictionary
data = {'Name': ['Shen Lee', 'Leon Buhle', 'Tracy Adams',
                 'Lebo Sinuka', 'Lauren Pierce', 'Monika Bond',
                 'Natahs Allsopp', 'Nicholas Winter',
                 'Christopher Eckson', 'Siobhan OMalley'],
        'Annual': [23, 20, 15, 19, 21, 21, 10, 15, 16, 23],
        'Sick': [10, 8, 10, 9, 7, 10, 9, 10, 8, 5],
        'Personal': [5, 4, 5, 0, 5, 2, 5, 4, 2, 5],
        'Bonus': [3, 0, 0, 3, 3, 6, 0, 3, 6, 3]}
row_labels = [215, 216, 217, 218, 219, 220, 221, 222, 223, 224]
leave_cycle = pd.DataFrame(data, columns=['Name', 'Annual',
                                          'Sick', 'Personal', 'Bonus'],
                           index = row_labels)

leave_cycle.index.name = 'Personnel_ID'

# View the DataFrame
leave_cycle

                            Name  Annual  Sick  Personal  Bonus
Personnel_ID
215                     Shen Lee      23    10         5      3
216                   Leon Buhle      20     8         4      0
217                  Tracy Adams      15    10         5      0
218                  Lebo Sinuka      19     9         0      3
219                Lauren Pierce      21     7         5      3
220                  Monika Bond      21    10         2      6
221               Natahs Allsopp      10     9         5      0
222              Nicholas Winter      15    10         4      3
223           Christopher Eckson      16     8         2      6
224              Siobhan OMalley      23     5         5      3

#

### Additional columns

In [3]:
# Create a DataFrame from a dictionary
data = {'Name': ['Shen Lee', 'Leon Buhle', 'Tracy Adams',
                 'Lebo Sinuka', 'Lauren Pierce', 'Monika Bond',
                 'Natahs Allsopp', 'Nicholas Winter',
                 'Christopher Eckson', 'Siobhan OMalley'],
        'Annual': [23, 20, 15, 19, 21, 21, 10, 15, 16, 23],
        'Sick': [10, 8, 10, 9, 7, 10, 9, 10, 8, 5],
        'Personal': [5, 4, 5, 0, 5, 2, 5, 4, 2, 5],
        'Bonus': [3, 0, 0, 3, 3, 6, 0, 3, 6, 3],
        'Total leave taken': [0, 3, 5, 10, 5, 8, 11, 9, 15, 5],
        'Total leave available': [38, 32, 30, 28, 33, 33, 24, 29, 26, 33],
        'Annual total': [38, 35, 35, 38, 38, 41, 35, 38, 41, 38]}
row_labels = [215, 216, 217, 218, 219, 220, 221, 222, 223, 224]
leave_cycle = pd.DataFrame(data, columns=['Name', 'Annual',
                                          'Sick', 'Personal', 'Bonus',
                                          'Total leave taken',
                                          'Total leave available'],
                           index = row_labels)
leave_cycle.index.name = 'Personnel_ID'

# View the DataFrame
leave_cycle

,Name,Annual,Sick,Personal,Bonus,Total leave taken,Total leave available
Personnel_ID,,,,,,,
215,Shen Lee,23,10,5,3,0,38
216,Leon Buhle,20,8,4,0,3,32
217,Tracy Adams,15,10,5,0,5,30
218,Lebo Sinuka,19,9,0,3,10,28
219,Lauren Pierce,21,7,5,3,5,33
220,Monika Bond,21,10,2,6,8,33
221,Natahs Allsopp,10,9,5,0,11,24
222,Nicholas Winter,15,10,4,3,9,29
223,Christopher Eckson,16,8,2,6,15,26
224,Siobhan OMalley,23,5,5,3,5,33